{"backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"name": "input_2", "config": {"name": "input_2", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_3", "config": {"name": "input_3", "batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "concatenate_8", "config": {"trainable": true, "name": "concatenate_8", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["input_2", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"name": "conv2d_9", "config": {"activation": "linear", "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_9", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "filters": 64, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0, "seed": null, "stddev": 0.02}, "class_name": "RandomNormal"}}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.20000000298023224}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_10", "config": {"activation": "linear", "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_10", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "filters": 128, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0, "seed": null, "stddev": 0.02}, "class_name": "RandomNormal"}}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "batch_normalization_14", "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.9, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "epsilon": 1.01e-05, "gamma_initializer": {"config": {"mean": 1.0, "seed": null, "stddev": 0.02}, "class_name": "RandomNormal"}, "name": "batch_normalization_14", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "trainable": true, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "config": {"trainable": true, "name": "leaky_re_lu_9", "alpha": 0.20000000298023224}, "class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_11", "config": {"activation": "linear", "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_11", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "trainable": true, "filters": 1, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0, "seed": null, "stddev": 0.02}, "class_name": "RandomNormal"}}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "sigmoid"}, "class_name": "Activation", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}], "output_layers": [["activation_10", 0, 0]], "name": "model_2"}, "class_name": "Model", "keras_version": "2.1.5"}